In [2]:
import pandas as pd
import numpy as np

data =pd.read_csv("data+files/california_restaurants.csv")
df=pd.read_csv("data+files/example_1.csv", index_col="date")

In [3]:
df

            Stock_A  Stock_B  Stock_C
date
2023-01-01     20.0      NaN     19.0
2023-01-02    465.0      NaN      NaN
2023-01-03      NaN     14.0     86.0
2023-01-04      NaN     25.0     19.0
2023-01-05     25.0      9.0      NaN
2023-01-06     75.0     75.0     19.0

In [4]:
df.Stock_A.isna()# retorna uma série booleana indicando True para os locais
#onde os valores estão ausentes (NaN) e False onde os valores estão presentes.

date
2023-01-01    False
2023-01-02    False
2023-01-03     True
2023-01-04     True
2023-01-05    False
2023-01-06    False
Name: Stock_A, dtype: bool

In [5]:
df.loc[df.Stock_A.isna()]

            Stock_A  Stock_B  Stock_C
date
2023-01-03      NaN     14.0     86.0
2023-01-04      NaN     25.0     19.0

In [6]:
df.isna()

            Stock_A  Stock_B  Stock_C
date
2023-01-01    False     True    False
2023-01-02    False     True     True
2023-01-03     True    False    False
2023-01-04     True    False    False
2023-01-05    False    False     True
2023-01-06    False    False    False

In [7]:
df[df.Stock_A.notna()]

            Stock_A  Stock_B  Stock_C
date
2023-01-01     20.0      NaN     19.0
2023-01-02    465.0      NaN      NaN
2023-01-05     25.0      9.0      NaN
2023-01-06     75.0     75.0     19.0

In [8]:
# isnull(),notnull()funciona, mas não mais usado.

In [9]:
df

            Stock_A  Stock_B  Stock_C
date
2023-01-01     20.0      NaN     19.0
2023-01-02    465.0      NaN      NaN
2023-01-03      NaN     14.0     86.0
2023-01-04      NaN     25.0     19.0
2023-01-05     25.0      9.0      NaN
2023-01-06     75.0     75.0     19.0

In [11]:
df.Stock_A + 100 #NaN não soma

date
2023-01-01    120.0
2023-01-02    565.0
2023-01-03      NaN
2023-01-04      NaN
2023-01-05    125.0
2023-01-06    175.0
Name: Stock_A, dtype: float64

In [12]:
df.Stock_A + df.Stock_B # somar com NaN dá NaN

date
2023-01-01      NaN
2023-01-02      NaN
2023-01-03      NaN
2023-01-04      NaN
2023-01-05     34.0
2023-01-06    150.0
dtype: float64

In [14]:
data.info() #comparar entries com valores para ver quantos NaN

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1273 entries, 0 to 1272
Data columns (total 18 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Yelp URL           1273 non-null   object
 1   Name               1273 non-null   object
 2   Street Address     1273 non-null   object
 3   Zip Code           1259 non-null   float64
 4   City               1263 non-null   object
 5   State              1259 non-null   object
 6   Price Range        1067 non-null   object
 7   Phone              1196 non-null   object
 8   Rating             1270 non-null   float64
 9   Number of Reviews  1270 non-null   float64
 10  Website            974 non-null    object
 11  Menu Link          591 non-null    object
 12  Image 1            1268 non-null   object
 13  Image 2            1262 non-null   object
 14  Image 3            1255 non-null   object
 15  Category 1         1273 non-null   object
 16  Category 2         1004 non-null   object
 17  Category 3         668 non-null    object
dtypes: float64(3), object(15)
memory usage: 179.1+ KB

Abordagens para lidar com NaN

In [15]:
data.dropna() # apagar todos registos com NaN

,Yelp URL,Name,Street Address,Zip Code,City,State,Price Range,Phone,Rating,Number of Reviews,Website,Menu Link,Image 1,Image 2,Image 3,Category 1,Category 2,Category 3
2,https://www.yelp.com/biz/julies-cafe-chino-3,Julie's Cafe,3746 Riverside Dr,91710.0,Chino,CA,$$,(909) 992-0013,4.5,179.0,www.juliescafes.com,www.juliescafes.com/menu/,https://s3-media0.fl.yelpcdn.com/bphoto/__RSTK...,https://s3-media0.fl.yelpcdn.com/bphoto/bdPEPF...,https://s3-media0.fl.yelpcdn.com/bphoto/7d4bRB...,Bagels,Breakfast & Brunch,Cafes
6,https://www.yelp.com/biz/sul-and-beans-rowland...,Sul & Beans,1330 Fullerton Rd Unit 110,91748.0,Rowland Heights,CA,$$,(626) 581-1581,4.0,643.0,www.sulandbeans.com,www.sulandbeans.com/menu,https://s3-media0.fl.yelpcdn.com/bphoto/l4NVad...,https://s3-media0.fl.yelpcdn.com/bphoto/TC-TF4...,https://s3-media0.fl.yelpcdn.com/bphoto/ku9I_Q...,Desserts,Shaved Ice,Coffee & Tea
8,https://www.yelp.com/biz/ginkgo-katsu-diamond-bar,Ginkgo Katsu,1131 Brea Canyon Rd,91789.0,Diamond Bar,CA,$$,(909) 895-7808,4.5,328.0,ginkgokatsu.com,www.ginkgokatsu.com/menu,https://s3-media0.fl.yelpcdn.com/bphoto/qkoUPC...,https://s3-media0.fl.yelpcdn.com/bphoto/GRYdvA...,https://s3-media0.fl.yelpcdn.com/bphoto/iZW9yp...,Japanese,Bubble Tea,Coffee & Tea
9,https://www.yelp.com/biz/king-coffee-usa-anahe...,King Coffee USA,321 W Katella Ste 142,92802.0,Anaheim,CA,$,(714) 864-3874,3.5,74.0,kingcoffeeusa.com,kingcoffeeusa.com/pages/menu,https://s3-media0.fl.yelpcdn.com/bphoto/zo5D1-...,https://s3-media0.fl.yelpcdn.com/bphoto/46CWX4...,https://s3-media0.fl.yelpcdn.com/bphoto/vkmktN...,Coffee & Tea,Juice Bars & Smoothies,Sandwiches
10,https://www.yelp.com/biz/coffee-up-roastery-fu...,Coffee Up Roastery,1950 Sunny Crest Dr Ste 1000,92835.0,Fullerton,CA,$,(714) 519-3407,5.0,27.0,www.coffeeuproastery.com,coffeeuproastery.com/menu,https://s3-media0.fl.yelpcdn.com/bphoto/3aMNgz...,https://s3-media0.fl.yelpcdn.com/bphoto/WTjEM1...,https://s3-media0.fl.yelpcdn.com/bphoto/DbBuhb...,Coffee & Tea,Sandwiches,Cafes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1252,https://www.yelp.com/biz/lazy-dog-restaurant-a...,Lazy Dog Restaurant & Bar,1623 W Katella Ave,92867.0,Orange,CA,$$,(714) 769-7020,4.0,2286.0,lazydogrestaurants.com//?olonwp=z17TA_tz20aL5U...,order.lazydogrestaurants.com/menu/orange%3Folo...,https://s3-media0.fl.yelpcdn.com/bphoto/9S0Wki...,https://s3-media0.fl.yelpcdn.com/bphoto/5a936v...,https://s3-media0.fl.yelpcdn.com/bphoto/KbAj-r...,American (New),Comfort Food,Burgers
1254,https://www.yelp.com/biz/banana-bay-restaurant...,Banana Bay Restaurant,18230 Colima Rd,91748.0,Rowland Heights,CA,$$,(626) 839-5511,3.5,3380.0,www.bananabayrh.com,www.bananabayrh.com,https://s3-media0.fl.yelpcdn.com/bphoto/9wOhuk...,https://s3-media0.fl.yelpcdn.com/bphoto/mweaTU...,https://s3-media0.fl.yelpcdn.com/bphoto/16-jvl...,Thai,Chinese,Seafood
1259,https://www.yelp.com/biz/green-tomato-grill-brea,Green Tomato Grill,796 N Brea Blvd,92821.0,Brea,CA,$$,(714) 831-0958,4.0,942.0,greentomatogrill.com,www.greentomatogrill.com/menu,https://s3-media0.fl.yelpcdn.com/bphoto/zAb33L...,https://s3-media0.fl.yelpcdn.com/bphoto/zAkM5p...,https://s3-media0.fl.yelpcdn.com/bphoto/IISH-V...,American (New),Gluten-Free,Vegan
1267,https://www.yelp.com/biz/snooze-an-a-m-eatery-...,"Snooze, an A.M. Eatery",240 W Chapman Ave Ste 101,92866.0,Orange,CA,$$,(714) 769-6947,4.5,1538.0,www.snoozeeatery.com//?utm_source=yelp&utm_med...,www.snoozeeatery.com/food-menu/,https://s3-media0.fl.yelpcdn.com/bphoto/rjMFEB...,https://s3-media0.fl.yelpcdn.com/bphoto/pEdNjX...,https://s3-media0.fl.yelpcdn.com/bphoto/_wP-ll...,Breakfast & Brunch,American (Traditional),Cocktail Bars
1269,https://www.yelp.com/biz/yard-house-brea-4,Yard House,160 S Brea Blvd,92821.0,Brea,CA,$$,(714) 529-9273,3.5,1511.0,www.yardhouse.com/locations/ca/brea/brea-downt...,www.yardhouse.com/menu/mains/steaks-chops%3Fse...,https://s3-media0.fl.yelpcdn.com/bphoto/n8vOBh...,https://s3-media0.fl.yelpcdn.com/bphoto/k3Abev...,https://s3-media0.fl.yelpcdn.com/bphoto/DENhgb...,American (New),Vegetarian,Bars

In [17]:
data.dropna(subset="Zip Code").shape # somente se houver NaN em Zio Code

(1259, 18)

In [18]:
data.dropna(subset=["Zip Code", "Name", "Price Range", "Rating"]).shape

(1055, 18)

In [19]:
data.dropna(subset=["Zip Code", "City"]).shape

(1259, 18)

In [21]:
data.dropna(subset=["Zip Code", "City"], how = "all").shape #how = "any" padrao
# somente apaga se as duas tiverem NaN

(1263, 18)

In [22]:
data.dropna(subset=["Zip Code", "City"], how = "all").dropna(
    subset=["Name", "Price Range", "Rating"]).shape
# Se as duas tiverem NaN e qualquer outra tiver NaN

(1059, 18)

In [23]:
df

            Stock_A  Stock_B  Stock_C
date
2023-01-01     20.0      NaN     19.0
2023-01-02    465.0      NaN      NaN
2023-01-03      NaN     14.0     86.0
2023-01-04      NaN     25.0     19.0
2023-01-05     25.0      9.0      NaN
2023-01-06     75.0     75.0     19.0

In [25]:
df.dropna(axis=1) # apagar colula que tenha NaN

Empty DataFrame
Columns: []
Index: [2023-01-01, 2023-01-02, 2023-01-03, 2023-01-04, 2023-01-05, 2023-01-06]

In [26]:
# trocar NaN por 0
df.fillna(0)

            Stock_A  Stock_B  Stock_C
date
2023-01-01     20.0      0.0     19.0
2023-01-02    465.0      0.0      0.0
2023-01-03      0.0     14.0     86.0
2023-01-04      0.0     25.0     19.0
2023-01-05     25.0      9.0      0.0
2023-01-06     75.0     75.0     19.0

In [29]:
df

            Stock_A  Stock_B  Stock_C
date
2023-01-01     20.0      NaN     19.0
2023-01-02    465.0      NaN      NaN
2023-01-03      NaN     14.0     86.0
2023-01-04      NaN     25.0     19.0
2023-01-05     25.0      9.0      NaN
2023-01-06     75.0     75.0     19.0

In [28]:
#trocar o NaN pelo valor anterior - front fill
df.ffill()

            Stock_A  Stock_B  Stock_C
date
2023-01-01     20.0      NaN     19.0
2023-01-02    465.0      NaN     19.0
2023-01-03    465.0     14.0     86.0
2023-01-04    465.0     25.0     19.0
2023-01-05     25.0      9.0     19.0
2023-01-06     75.0     75.0     19.0

In [30]:
df.bfill()#trocar pelo valor da frente- back fill

            Stock_A  Stock_B  Stock_C
date
2023-01-01     20.0     14.0     19.0
2023-01-02    465.0     14.0     86.0
2023-01-03     25.0     14.0     86.0
2023-01-04     25.0     25.0     19.0
2023-01-05     25.0      9.0     19.0
2023-01-06     75.0     75.0     19.0

In [31]:
df.bfill(limit=1)

            Stock_A  Stock_B  Stock_C
date
2023-01-01     20.0      NaN     19.0
2023-01-02    465.0     14.0     86.0
2023-01-03      NaN     14.0     86.0
2023-01-04     25.0     25.0     19.0
2023-01-05     25.0      9.0     19.0
2023-01-06     75.0     75.0     19.0

In [33]:
df.bfill(limit=1).ffill(limit=1)

            Stock_A  Stock_B  Stock_C
date
2023-01-01     20.0      NaN     19.0
2023-01-02    465.0     14.0     86.0
2023-01-03    465.0     14.0     86.0
2023-01-04     25.0     25.0     19.0
2023-01-05     25.0      9.0     19.0
2023-01-06     75.0     75.0     19.0

In [34]:
df.fillna(df.mean()) #preencher com a media

            Stock_A  Stock_B  Stock_C
date
2023-01-01    20.00    30.75    19.00
2023-01-02   465.00    30.75    35.75
2023-01-03   146.25    14.00    86.00
2023-01-04   146.25    25.00    19.00
2023-01-05    25.00     9.00    35.75
2023-01-06    75.00    75.00    19.00

In [35]:
df.mean()

Stock_A    146.25
Stock_B     30.75
Stock_C     35.75
dtype: float64

In [36]:
df.mean(axis='columns')#media da row!!!

date
2023-01-01     19.500000
2023-01-02    465.000000
2023-01-03     50.000000
2023-01-04     22.000000
2023-01-05     17.000000
2023-01-06     56.333333
dtype: float64

In [37]:
df.where(df.notna(),df.mean(axis=1),axis=0) # preenchercom a media da linha

            Stock_A  Stock_B  Stock_C
date
2023-01-01     20.0     19.5     19.0
2023-01-02    465.0    465.0    465.0
2023-01-03     50.0     14.0     86.0
2023-01-04     22.0     25.0     19.0
2023-01-05     25.0      9.0     17.0
2023-01-06     75.0     75.0     19.0